"""
Напишите программу, которая меняет местами первый и последний элемент списка lst местами.
"""

lst = [3, 2, 6, 12, 39, 0]
f = 0
lst[-1], lst[f] = lst[f], lst[-1]
print (lst)