# Комментарий в Python (закомментированные строчки кода пропускаются интерпретатором)

# В Python поддерживаются 3 разных числовых типа:
# int - целые числа
a = 1
# float - вещественные числа (числа с дробной частью)
b = 1.2
# complex - комплексные числа
c = 1 + 2j

# bool - логический тип данных (два значения - True и False)
isMarried = False
isAdult = True

# str - строка (текст)
s1 = 'Hello'
s2 = "Hello"
s3 = '''Hello'''
s4 = """Hello"""

# Чтобы узнать, какого типа переменная, можно воспользоваться функцией type()
type(a)
# Чтобы привести один тип к другому, можно воспользоваться специальными функциями:
# int() - приводит число к целому типу (отбрасывает дробную часть)
# float() - приводит число к вещественному типу
# str() - превращает значение переменной в строку
# bool() - превращает значение переменной в логический тип данных
