"""
Для данного числа n<100 закончите фразу “На лугу пасется...” одним из возможных продолжений:
“n коров”, “n корова”, “n коровы”, правильно склоняя слово “корова”.

Входные данные:
Вводится натуральное число.

Выходные данные:
Программа должна вывести правильное выражение вместе с введенным числом 'n' и одним из слов: коров, корова, коровы.


Примеры:
Вход 1: 1
Выход 1: "На лугу пасется 1 корова."

Вход 2: 2
Выход 2: "На лугу пасется 2 коровы."

Вход 3: 10
Выход 3: "На лугу пасется 10 коров."
"""
