a = int(input('Введите число'))
if a == 1:
    print("Это январь!")
elif a == 2:
    print("Это февраль!")
elif a == 3:
    print("Это март!")
elif a == 4:
    print("Это апрель!")
elif a == 5:
    print("Это май!")
elif a == 6:
    print("Это июнь!")
elif a == 7:
    print("Это июль!")
elif a == 8:
    print("Это август!")
elif a == 9:
    print("Это сентябрь!")
elif a == 10:
    print("Это октябрь!")
elif a == 11:
    print("Это ноябрь!")
elif a == 12:
    print("Это декабрь!")
else:
    print('Такого месяца нет')

"""
Напишите программу, которая на вход будет принимать номер месяца,
а на выходе выводить время года, соответствующее месяцу.
Примеры:
Вход 1: 1
Выход 1: 'Зима'
Вход 2: 4
Выход 2: 'Весна'
Вход 3: 13
Выход 3: 'Времени года с таким месяцем не существует'
"""
