"""
Напишите программу, которая просит человека ввести его имя, возраст и рост, а затем выведите эту информацию на экран.
Используйте f-строки.

Примеры:

Вход:
Милена
23
165

Выход:
"Ваше имя - Милена, ваш возраст - 23, ваш рост - 165"
"""
n = input('Ваше имя: ')
a = input('Ваш возраст: ')
h = input('Ваш рост: ')
print(f"Ваше имя: {n}, ваш возраст: {a}, ваш рост: {h}")
